Revit 2024 API
CombinableElement Class
An element that can be added to a geometry combination.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CombinableElement : Element
Visual Basic
Public Class CombinableElement _
	Inherits Element
Visual C++
public ref class CombinableElement : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.GeomCombination
See Also
CombinableElement Members
Autodesk.Revit.DB Namespace